## Numpy

### task1

In [1]:
import numpy as np

In [2]:
a = np.array([[1,6],[2,8],[3,11],[3,10],[1,7]])
a_mean = a.mean(axis=0)
a_mean

array([2. , 8.4])

### task2

In [3]:
a_centered = a - a_mean
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

### task3

In [4]:
a_centered_sp = a_centered[:,0]@a_centered[:, 1]
a_centered_sp

8.0

N = a.shape[0]
result = a_centered_sp/N
result

## Pandas

### task 1

In [5]:
import pandas as pd

authors = pd.DataFrame({
    "author_id":[1,2,3],
    "author_name":["Тургенев", "Чехов","Островский"]
})

books = pd.DataFrame({
    "author_id":[1,1,1,2,2,3,3],
    "book_title":["Отцы и дети","Рудин","Дворянское гнездо","Толстый и тонкий","Дама с собачкой","Гроза","Таланты и поклонники"],
    "price":[450, 300, 350, 500, 450, 370, 290]
})
authors
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### task 2

In [6]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### task 3

In [7]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### task 4

In [22]:

tmp = authors_price.groupby("author_name").max().reset_index()

authors_stat = authors_price.groupby('author_name').agg({'price': ['mean', 'min', 'max']})

authors_stat.columns = ['price_mean', 'price_min', 'price_max']

authors_stat = authors_stat.reset_index()

authors_stat

  author_name  price_mean  price_min  price_max
0  Островский  330.000000        290        370
1    Тургенев  366.666667        300        450
2       Чехов  475.000000        450        500